{"sessions":[{"intendedAudience":"De som jobber eller har jobbet i mer eller mindre smidige utviklingsteam. Spesielt de som jobber i team eller prosjekt som i teorien er smidige men som i praksis kanskje har litt å gå på vil kunne ha nytte av dette. Ingen kode vil bli kvestet i dette innlegget!","endTimeZulu":"2017-10-30T11:15:00Z","keywords":["Agile","topic:Other Awesomeness","type:"],"format":"presentation","language":"no","sessionId":"7af19f6d-a41a-4f63-8b1b-a57fcd2f8e2e","abstract":"Smidig/Agile er blitt et velkjent begrep, og 16 år etter det berømte manifestet ble skrevet kan det føles som om det meste er sagt. Men nå som smidig har blitt mainstream er vi kanskje blitt så vant med våre standups og JIRA boards at vi har glemt litt av poenget? Har vi blitt passive medlemmer i Smidig-kulten som blindt følger en oppskrift? I denne presentasjonen går jeg inn på trusselen Smidig-kulten utgjør mot smidighet, og går tilbake til det jeg mener er kjernen av smidig for å finne mottiltak. Kanskje kan vi også lære noe om smidighet fra matlaging?\n\nJeg håper innlegget kan øke bevisstheten om hva poenget med å jobbe smidig er og med det inspirere andre til å jobbe smidigere. Fordi en smidigere verden gjør meg glad!","published":"true","video":"https://vimeo.com/240500427","title":"Vær på vakt mot Smidig-kulten!","room":"Sal 2","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/d79e080b54cd74f3d03186040a4fdb4d?d=mm","name":"Svein Martin Gaasholt","bio":"Som scrum master/smidig-entusiast/prosessforbedrer i EVRY har jeg jobbet med flere utviklingsteam og prosjekt på team- og organisasjons-nivå for å jobbe smidigere og levere bedre. Klokketro på at en smidigere verden er en bedre verden, og at vi fremdeles har mye å gå på!"}],"startTime":"2017-10-30T11:45","endTime":"2017-10-30T12:15","slug":"vr_p_vakt_mot_smidigkulten"},{"intendedAudience":"Velkommen til front-end utviklere, interaksjonsdesignere,  prosjektledere ellers interesserte! Noen slides inneholder kode for å demonstrere filosofier i praksis. Det er dog ikke avgjørende for å få noe ut av foredraget.","endTimeZulu":"2017-10-30T11:15:00Z","keywords":["CSS","Philosophy","topic:Frontend","type:"],"format":"presentation","language":"no","sessionId":"9770c914-1182-438f-b414-51ba0ce6921d","abstract":"Vi har alle vært der: ønsket å stoppe prosjektet og \"rydde opp\". Samkjøre brukeropplevelse, rydde opp i spaghettikode og fase ut den-gang-gode-intensjoner som nå er blitt et hinder for utvikling. Men hvordan?\n\nI dette foredraget tar NRK deg med bak kulissene i \"prosjekt Bjartmar\". De deler erfaringer og enkle design og kode-prinsipper som har bidratt til brobygging mellom fagmiljøer og minsket kompleksitet.","published":"true","video":"https://vimeo.com/240484399","title":"Å bytte hjul på et tog i fart - under panseret på grensesnittutvikling hos NRK","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/f0dff00430349fdeced4747bd1a4e105?d=mm","name":"Eirik Backer","bio":"Eirik er ekte Trondheimer, men arbeider i disse dager som Fagansvarlig for Grensesnittutvikling i NRK. Han drømmer i vanilla Javascript og CSS, og søker løsninger hvor både elegant kode, design og brukerbehov møtes.\n\nHan arbeidet i 12 år med design og front-end utvikling i Norge, Kina, USA, Danmark og Trinidad, samt vært hovedlærer i Web og Interaksjonsdesign ved Norges Kreative Høyskole."}],"startTime":"2017-10-30T11:45","endTime":"2017-10-30T12:15","slug":"_bytte_hjul_p_et_tog_i_fart__und"},{"intendedAudience":"Developers. Code in slides AND live coding.","endTimeZulu":"2017-10-30T10:30:00Z","keywords":["Clean Code","Monads","topic:Craftmanship","type:"],"format":"presentation","language":"en","sessionId":"75efd4ee-7b0a-409c-8c5f-79714dd46c8c","abstract":"One of the great things about being a programmer is that you never stop learning. Even after having programmed for almost 35 years, I still improve on the way I write code. Recently the way I write code changed once again when I started to apply monads and especially the Try class. \nDuring a recent project, my team created a small library that ports the behavior of the Scala Try monad. Although at first this new monad didn't appeal to me, I soon really started to appreciate this style of programming, where we concatenate series of Map() and FlatMap() methods, using lambda’s, and avoiding abundant try-catch blocks, and many if statements and null checks. \nIn the meantime, I have contaminated many programmers with this style. Developers make it a sport to always start every method with e return statement. During this talk I’ll demonstrate the power of this simple monad, using many code examples (in Java, C# and TypeScript). Don't hesitate to join in.","published":"true","video":"https://vimeo.com/240517678","title":"Do or don’t. There’s no try. Or is there? The power of monads explained. Sort of","room":"Sal 3","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/58c16f97d28ebca36bbf3efff76258ce?d=mm","name":"Sander Hoogendoorn","bio":"Sander Hoogendoorn is a dad, an independent software craftsman, coach, speaker, trainer and writer. He is seasoned in agile, Scrum, Kanban, continuous delivery, (no) software estimation, agile requirements, design patterns, domain driven design, UML, software architecture, microservices, and both Java and .NET development. \nSander changes organizations and teams and coaches them to optimize their processes, practices, architecture, code and tests, currently as chief technology officer at ANVA. Sander authored best-selling books such as The Continuous Culture, This Is Agile and Pragmatic Modeling with UML and published many articles in international magazines. He is an inspiring (keynote) speaker at conferences, presented hundreds of (in-house) training courses and lectured at many universities."}],"startTime":"2017-10-30T11:00","endTime":"2017-10-30T11:30","slug":"do_or_dont_theres_no_try_or_is_t"},{"intendedAudience":"Operations engineers and developers with some experience working on automatic deployment systems are the target for this talk.\nIts goal is to give a broader understanding of continuous delivery, and show some real life examples of how it has been implemented.\nThere will be some code used to describe the various delivery pipelines that will be discussed, but this will also be illustrated in other ways.","endTimeZulu":"2017-10-30T14:30:00Z","keywords":["Continuous Delivery","DevOps","topic:Craftmanship","type:"],"format":"presentation","language":"en","sessionId":"7e6d3510-2e60-472b-94a8-97bc1d1c150a","abstract":"Continuous delivery is now a household name in software development. Automation is the name of the game.\nCopying jar files to your production servers using scp is just an embarrassing memory.\n\nDuring the talk we will take a step back and look at which trade offs must be done when automating code promotion.\nNot all code is created equal, and the goal is not always to make the latest changes available\nas soon as possible. There are cases where the pipeline should avoid pushing the changes to all targets immediately.\n\nDisruptive Technologies’ three main systems; a micro service cluster running on\nKubernetes, IoT sensors, and the gateway that bridge the two former components,\nwill be used to illustrate the different requirements from a delivery pipeline.\n. \nThe delivery pipeline for these three systems will be compared to an idealised delivery pipeline\nto show the concessions done to make it work in the real world.\n\nAfter this talk you should understand when a continuous delivery pipeline should move forward with blazing speed,\nand when it should hold back your changes .","published":"true","video":"https://vimeo.com/240513770","title":"Updating IoT devices, cloud services, and everything in between","room":"Sal 2","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/e1b69628e8f1e3000e36e0e22272641d?d=mm","name":"Eirik Nygaard","bio":"Eirik has spent the last ten years working with search and distributed systems.\nAt Yahoo he improved and built the continuous test and delivery components used by their internal search platform.\nNow he is working for Disruptive Technologies, where is he automating away all repetitive tasks.\nEnsuring that the engineers there can focus on improving Disruptive Technologies’ IoT platform.."}],"startTime":"2017-10-30T15:00","endTime":"2017-10-30T15:30","slug":"updating_iot_devices_cloud_servi"},{"intendedAudience":"This talk is for anyone interested in getting started with VR on the web. No prior experience with virtual reality is required, but basic familiarity with javascript and web development is assumed.","endTimeZulu":"2017-10-30T09:45:00Z","keywords":["Virtual Reality","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"90a1950a-c722-4399-8335-abca43e5c5ee","abstract":"Delivering VR via the web browser makes it possible to create shared virtual reality experiences for everyone, even for those who do not yet have VR headsets. This means you can fully leverage your existing javascript and webdev-skills to build amazing interactive, immersive VR! \n\nBy the end of this talk you will have gained an appreciation for the huge potential of WebVR, a kickstart on the development frameworks A-Frame and React VR, and be ready to start cooking up the future of virtual reality on the open web.","published":"true","video":"https://vimeo.com/240470617","title":"VR for web developers: going cross-platform and social with WebVR","room":"Sal 5","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T09:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/1970780329c4ba918f6ef8878fed59df?d=mm","name":"Martin Sivertsen","bio":"Martin has worked within the online media industry for over 16 years as a programmer, journalist, designer, podcast host and producer. He co-founded the respected online film magazine Montages, and has created a wide array of web sites and apps with Aller Internet and web agencies Klapp and Increo. Today, he is the lead developer at the Trondheim-based VR company Breach, working on immersive visualisations and social virtual reality solutions for headsets, browsers and beyond."}],"startTime":"2017-10-30T10:15","endTime":"2017-10-30T10:45","slug":"vr_for_web_developers_going_cros"},{"intendedAudience":"Any Java programmer running code or planning to run code on a Java 9 VM, no matter if Java 9 features are used or not.","endTimeZulu":"2017-10-30T16:00:00Z","keywords":["Java 9","topic:Backend","type:"],"format":"presentation","language":"en","sessionId":"46f0e0fa-d811-44d1-9509-b5eebd46e02d","abstract":"Java 9 introduces modules to the Java programming language and its runtime. Despite this feature being optional, due to the modularization of the standard library existing applications might behave differently when running on a version 9 JVM. Furthermore, because of changes in the runtime, existing libraries and frameworks might not yet correctly process your modularized code. As a result, updating to a Java 9 VM and taking Java 9 into brings its challanges.\\n\\nThis talk discusses the practical implications of module boundaries and analyzes new limitations Java 9 imposes on the reflection API. This talk explains how reflection is used in popular frameworks like Spring and Hibernate and explains why existing applications might break or change their behavior when facing modularized code. Finally, this talk showcases alternatives to now failing Java programming patterns and weights their robustness with regard to the Java releases 10 and upward.\\n\\nThe presenter is an active contributor to open source and helped to migrate many popular Java libraries to supporting Java 9. As a consequence, he as been working with Java 9 for almost two years.","published":"true","video":"https://vimeo.com/240535484","title":"Getting started with Java 9 modules","room":"Sal 3","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T15:30:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/bc96521f79789d75fa63cfa5c2758765?d=mm","name":"Rafael Winterhalter","bio":"Rafael works as a software consultant in Oslo, Norway. He is a proponent of static typing and a JVM enthusiast with particular interest in code instrumentation, concurrency and functional programming. Rafael blogs about software development, regularly presents at conferences and was pronounced a JavaOne Rock Star. When coding outside of his work place, he contributes to a wide range of open source projects and often works on Byte Buddy, a library for simple runtime code generation for the Java virtual machine. For his work, Rafael received a Duke's Choice award and was elected a Java Champion."}],"startTime":"2017-10-30T16:30","endTime":"2017-10-30T17:00","slug":"getting_started_with_java_9_modu"},{"intendedAudience":"Trace amounts of python code in slides.\n\nEveryone who attends will learn something as I will mainly be talking about an application of machine learning, not specifically about machine learning algorithms, implementations, or advanced techniques.\n\nI will briefly discuss the scientific python packages that we're applying to the problem, and how they help us getting things done, without getting into much code or details.","endTimeZulu":"2017-10-30T09:45:00Z","keywords":["BigData","Machine learning","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"20bd2461-5cf1-4e4d-8779-65bc686eeef8","abstract":"It is often repeated that the sea floor and its mysteries are less well known than the surface of Mars. In this talk I will talk about mapping the sea floor using underwater hyperspectral imaging, a recently developed technique for mapping of species and habitats on the sea floor. Given the copious amounts of data produced by a hyperspectral camera, custom software must be written to interpret the data. An example application, coral health mapping, will be discussed in more detail. Scientific python packages are essential to our analyses, so their use will be discussed, too.","published":"true","video":"https://vimeo.com/240490239","title":"Coral health check using hyperspectral machine learning","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T09:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/09150620d9317a7d436479cf55af1685?d=mm","name":"Paul Anton Letnes","bio":"I have always had an interest in all things physics, and through my MSc and PhD work in computational physics I grew very fond of computers and coding. While I don't see myself as a software developer as such, I do write a lot of code. I have worked on both physics simulation software and data analysis, and currently, I work at Ecotone AS as data analyst.\n\nMy everyday work tasks include hyperspectral image analysis using physics, machine learning, statistics, and a sprinkle of software development thrown into the mix. Mostly I analyse optical spectra, but image analysis is also an indispensable tool. Needless to say, the amount of data calls for custom software development for most of my analysis work."}],"startTime":"2017-10-30T10:15","endTime":"2017-10-30T10:45","slug":"coral_health_check_using_hypersp"},{"intendedAudience":"Everyone curious about machine learning","keywords":["Machine learning","topic:Other Awesomeness","type:"],"conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/656d522b5a93ff6b337d66c0a247e7cb?d=mm","name":"Mathias Brandewinder","bio":"Mathias Brandewinder has been developing software on .NET for about 10 years, and loving every minute of it, except maybe for a few release days. His language of choice was C#, until he discovered F# and fell in love with it. He enjoys arguing about code and how to make it better, and gets very excited when discussing TDD or F#. His other professional interests include forecasting models, machine learning and applying math to solve business problems. Mathias is a Microsoft F# MVP and the founder of Clear Lines Consulting. He is based in San Francisco, blogs at www.clear-lines.com/blog"}],"format":"workshop","language":"en","sessionId":"805e3b4f-0fc5-40e2-a194-3c1e1c56ab74","abstract":"Machine Learning and Functional Programming are both very hot topics these days; they are also both rather intimidating for the beginner. In this workshop, we will take a 100% hands-on approach, and learn practical ideas from Machine Learning, by tackling real-world problems and implementing solutions in F#, in a functional style.\n\nIn the process, you will see that once you get beyond the jargon, F# and Machine Learning are actually not all that complicated – and fit beautifully together. So if you are curious about what Machine Learning is about, and want to sharpen your developer skills, come with your laptop and… lets hack together!\n\nWhat you should expect:\n•\tNo F# or Machine Learning prerequisites: complete beginners are totally welcome.\n•\tA hands-on introduction to simple Machine Learning ideas you can use, by solving real-world problems.\n•\tA practical introduction to writing effective F# code.\n•\tLots of coding on fun problems!\n\nComputer setup:\nAttendees will need a laptop with an IDE or editor running F#. Check www.fsharp.org for instructions on how to get setup.","published":"true","title":"Practical Machine Learning with Functional Programming (2 Days)","slug":"practical_machine_learning_with_"},{"intendedAudience":"No code","endTimeZulu":"2017-10-30T13:00:00Z","keywords":["BigData","living with the ebb and flow of data","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"5fcbd6cd-1a2e-42d4-b2b6-94532120dc9a","abstract":"We humans hunt for meaning in life and a reason to why we are here.\nJo Røislien takes us all through subjects from the challenges with our hunt for meaningfulness, to Florence Nightingale, the american presidential election, vikings, space, salmon and mentos.. \nIs more information always better? Are really 'Big Data' the answer, or just a new question in itself?","published":"true","title":"How do we know that we know?","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T12:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/f094db5875190c70d06e7e8b9d8f4a5f?d=mm","name":"Jo Røislien","bio":"Jo Røislien is one of Norway's most prominent research and science lecturers. He loves numbers, has the hair of a Norwegian troll, drinks (instant) coffee with milk and thinks yesterday is greatly overrated.\n\nWhile other researchers lecture in tired classrooms and lecture halls, Jo lectures on TV. He was the presenter and scriptwriter for the successful mathematical TV series \"Siffer\" at NRK1 in the fall of 2011, and in autumn 2012 he was the first Norwegian presenter on the Discovery Channel.\n\nJo has a PhD in Statistics from NTNU and cooperates with a number of medical research communities across the country. He is currently Associate Professor in Statistics at the University of Stavanger and Senior Researcher at the Faculty of Medicine at the University of Oslo.\n\nHe has written several books, including \"Tall forteller\" with statistics researcher Kathrine Frey Frøslie and \"Siffer\" together with copywriter Magnus Nome."}],"startTime":"2017-10-30T13:15","endTime":"2017-10-30T14:00","slug":"how_do_we_know_that_we_know"},{"intendedAudience":"Software Engineers, Software Developers, Software Testers, Leaders","endTimeZulu":"2017-10-30T10:30:00Z","keywords":["Security","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"7cf7cb34-f76a-44fb-93aa-7542c577ef0d","abstract":"In this talk I will address the answers to the following questions based on research we have been doing with several companies in Norway. \n\nWhat is software security? Why should you care? What are the challenges software companies are facing in having security addressed in their Agile and Devops life cycle? What are activities/methods/approaches that works? How can  you start with Software Security?","published":"true","video":"https://vimeo.com/240496561","title":"Should we wait for a breach to worry about software security ?","room":"Sal 2","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/3543e4e090114447a8be569b1b7369d1?d=mm","name":"Daniela S. Cruzes","bio":"Dr. Daniela S. Cruzes is a senior researcher scientist at SINTEF. Previously, she was adjunct associate professor at the Norwegian University of Science and Technology (NTNU). She worked as a researcher fellow at the University of Maryland and Fraunhofer Center for Experimental Software Engineering-Maryland. Dr. Daniela Cruzes received her PhD in experimental software engineering from the University of Campinas - UNICAMP in Brazil in 2007. Her research interests are empirical software engineering, research methods and theory development, systematic reviews, synthesis of SE studies, software security, software maintenance and global software engineering."}],"startTime":"2017-10-30T11:00","endTime":"2017-10-30T11:30","slug":"should_we_wait_for_a_breach_to_w"},{"intendedAudience":"No code","endTimeZulu":"2017-10-30T11:15:00Z","keywords":["BigData","Machine learning","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"2210637a-50fa-48bf-9cbe-f56265e27348","abstract":"Powel prides itself on being at the forefront of the latest technological innovations and providing this to our customers. We have a long history in analytics with decades of cumulative education and hands on experience in optimization, mathematics & statistics, machine learning and artificial intelligence. Besides, we have deep domain expertise in energy, grid assets, trading, metering and utilities in general. We are approaching the 4th Industrial Revolution. Over the next decade advancements in AI, distributed ledgers and robotics will impact a variety of sectors. For utilities, these trends combined with the dramatic changes in energy transition such as distributed energy resources, increased proliferation of sensors on infrastructure and behind the meter devices and demand management advances will unleash a variety of transformative usecses in the sector. For example, devices which auto-detect demand levels on the grid and reduce power could be powered by AI and recorded by blockchain. There is opportunity in every disruption. In Powel we are trying to see the opportunity and transform into a data-driven business where we can unlock the opportunities and the value of data. Then, we would like to help our customers with this transformation. This transformation is a continues loop of improvements and innovation as opposed to mobile and digital transformation. In this talk, we present our different use cases within data science and machine learning.","published":"true","video":"https://vimeo.com/240492890","title":"Data-Driven Transformation, a Powel's Journey","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/9294284e80cb775c9efe9dda3f4eaa96?d=mm","name":"Mozhgan Tavakolifard","bio":"Tavakolifard holds a PhD in Machine Learning from NTNU, the Norwegian University of Science and Technology, in collaboration with University of California, Santa Barbara. After finalising her PhD in 2012, she worked as Data Scientist with Finn and then Schibsted Media Group. Tavakolifard was one of the key staff working on Schibsted’s transformation into a data-driven company. She contributed to Schibsted’s data strategy, helped hire and form the first data science team in the group, and created and led the first team working on implementation of personalisation solutions. She later joined Sigma as Director of Data Science and member of management team in Sigma Norway.\nTavakolifard started her first company, DharmicData, in 2015. The company, consisting of 12 word-class employees, became one of the first and biggest Nordic Data Centres of Excellence. They helped several major media companies with their data strategies and implementation of data-driven product and services, using their state-of-the-art data processing pipeline. In 2017, Tavakolifard exited DharmicData with the ambition to work on a new idea. Her second company, called IPower.Me, aims to give the power and control of personal data back to individuals and enable a personal data economy."}],"startTime":"2017-10-30T11:45","endTime":"2017-10-30T12:15","slug":"datadriven_transformation_a_powe"},{"intendedAudience":"No preliminary knowledge of machine learning or F# necessary. Expect some live coding!","endTimeZulu":"2017-10-30T16:00:00Z","keywords":["Paradigms","topic:Concepts / Theory","type:"],"format":"presentation","language":"en","sessionId":"b3e78382-1754-4ca1-8c46-efd0308964c9","abstract":"Just like traditional applications development, machine learning involves writing code. One aspect where the two differ is the workflow. While software development follows a fairly linear process (design, develop, and deploy a feature), machine learning is a different beast. You work on a single feature, which is never 100% complete. You constantly run experiments, and re-design your model in depth at a rapid pace. Traditional tests are entirely useless. Validating whether you are on the right track takes minutes, if not hours.\nIn this talk, we will take the example of a Machine Learning competition we recently participated in, the Kaggle Home Depot competition, to illustrate what \"doing Machine Learning\" looks like. We will explain the challenges we faced, and how we tackled them, setting up a harness to easily create and run experiments, while keeping our sanity. We will also draw comparisons with traditional software development, and highlight how some ideas translate from one context to the other, adapted to different constraints.","published":"true","video":"https://vimeo.com/240619857","title":"Agile experiments in Machine Learning with F#","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T15:30:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/656d522b5a93ff6b337d66c0a247e7cb?d=mm","name":"Mathias Brandewinder","bio":"Mathias Brandewinder has been developing software on .NET for about 10 years, and loving every minute of it, except maybe for a few release days. His language of choice was C#, until he discovered F# and fell in love with it. He enjoys arguing about code and how to make it better, and gets very excited when discussing TDD or F#. His other professional interests include forecasting models, machine learning and applying math to solve business problems. Mathias is a Microsoft F# MVP and the founder of Clear Lines Consulting. He is based in San Francisco, and blogs at www.brandewinder.com."}],"startTime":"2017-10-30T16:30","endTime":"2017-10-30T17:00","slug":"agile_experiments_in_machine_lea"},{"intendedAudience":"No code & basic concepts. First a short conceptual introduction to blockchain, then stories on how blockchain is and can be revolutionary.","endTimeZulu":"2017-10-30T15:15:00Z","keywords":["Blockchain","topic:Architecture","type:"],"format":"presentation","language":"en","sessionId":"8433ac5e-4988-4a2b-9a89-d55e2ac5735c","abstract":"$$$$$$$$$$$$$$$$$ Revolution is coming $$$$$$$$$$$$$$$$$$\n\n<><><><><><><><> Death to the Middleman <><><><><><><><><>\n\n!!!!!!!!!!!!!!!! DECENTRALIZE EVERYTHING !!!!!!!!!!!!!!!!\n\n1. Blockchain 1.0 ---------------------------------------\n\n2. Blockchain 2.0 ---------------------------------------\n\n3. Revolution -------------------------------------------\n___________________________","published":"true","video":"https://vimeo.com/240544796","title":"Blockchain revolution","room":"Sal 2","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/328158d24928b71dc00f1f8b7eb86db3?d=mm","name":"Jørgen Svennevik Notland","bio":"Jørgen: maker, web developer, hacker, founder & CTO @ www.iamflare.com. He lives in the future and loves nerdy talk. Jørgen har disregarded banks and strives for a bitcoin-enriched & bank-less life.\n\nhttps://medium.com/@jrgensvenneviknotland\nhttps://twitter.com/jQrgensn"}],"startTime":"2017-10-30T15:45","endTime":"2017-10-30T16:15","slug":"blockchain_revolution"},{"intendedAudience":"This talk is for everyone who wants to get a broader view on the topic. No coding experience required, the talk abstracts to algorithm classes and their benefits where needed, always supported by examples. No previous knowledge is necessary, but even for those more experienced with the algorithms this talk will provide some interesting points of view and food for thought. \n\nDepending on the public actually on site, this talk will be conducted in English or Norwegian, both with a Dutch accent.","endTimeZulu":"2017-10-30T10:30:00Z","keywords":["AI","topic:Concepts / Theory","type:"],"format":"presentation","language":"en","sessionId":"133b60b4-8f81-4a01-bc51-2fd569316185","abstract":"Suddenly \"Deep Learning\" is everywhere. It seems like there are not many problems which cannot be solved by Google, Microsoft, IBM, Amazon & Facebook's developments in AI. Siri, Pepper, Watson, Tesla and Alexa are becoming your \"intelligent personal agents\" and you can just sit down and relax?\n\nGood! Buckle up and join a journey through machine learning, from early attempts with neural nets in Amsterdam in the eighties through intelligent car systems at Mercedes Benz in the nineties towards the current hype around deep learning. This talk aims at demystifying through history supported by examples, going into more detail on some interesting work conducted in Norway!\nWelcome!","published":"true","video":"https://vimeo.com/240472637","title":"Machine Learning: technology shifting gear!","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/31b5b8508b0c1d1eda40678ecd9fc8a3?d=mm","name":"Robert Engels","bio":"Robert Engels har en internasjonal bakgrunn med fokus på flerfaglig kompetanse. Han har en doktorgrad i kunstig intelligens og maskinlæring, basert på faglig kompetanse fra informatikk, statistikk, kunnskapsmodellering og psykologi.\n \nHan er en ivrig foredragsholder og brenner for semantisk teknologi. Robert har vært veileder og sensor for ca 10 PhD studenter (NTNU, DERI, University of Gallway) og ca 50+ masterstudenter (NTNU, UiB, HiØ).\n \nEngels er knyttet til Norges Forskningsråd som fagekspert under programmet Brukerstyrt Innovasjonsarena (BIA), og har vært styreleder for faggruppe Semantisk Teknologi tilknyttet Den Norske Dataforeningen.\n \nDe siste årene har Robert konsentrert seg på kunnskapsmodellering, digitalisering, deling og publisering. Han har jobbet som avdelingsleder, prosjektleder og konsulent for  organisasjoner som NRK, Kulturrådet, Nasjonalmuseet, CognIT a.s, Deutsche Telekom og Mercedes Benz AG."}],"startTime":"2017-10-30T11:00","endTime":"2017-10-30T11:30","slug":"machine_learning_technology_shif"},{"intendedAudience":"Team leads, developers","endTimeZulu":"2017-10-30T11:15:00Z","keywords":["Continuous Delivery","topic:Craftmanship","type:"],"format":"presentation","language":"en","sessionId":"2e87e21b-4b0c-4240-a287-c90646e5348f","abstract":"With agile principles and practices reaching maturity, in many organizations the focus for the coming years will be on the next steps. Beyond agile. In fast pace organizations are adopting agile, DevOps, continuous delivery and new architectures such as microservices. Often all at once. Although from a perspective of similarities between these paradigms this makes sense, this also requires for increased collaboration between business, development and operations. During this session, Kim van Wilgen, CIO at the Dutch insurance company Klaverblad, will give practical insights on the process of migration to continuous delivery, with real-life examples from her experiences. How can organizations deal with the complexity of simultaneously changing architectures, ways of working, technology, and foremost culture? How can we make that change and at the same time still deliver software on a daily basis? How can we deliver continuous delivery?","published":"true","video":"https://vimeo.com/240521820","title":"Continuously delivering continuous delivery","room":"Sal 3","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/32f9be308b887028f42c6baa4235fc5c?d=mm","name":"Kim van Wilgen","bio":"In her role as Head of software development at the Dutch insurtech company ANVA, Kim van Wilgen is responsible for all software product development. Although a nerd at heart, she also has over a decade of experience in product management and comparable managerial roles on the other side: the business. She can speak the language of product owners and users to bridge the gap between business and IT. Kim van Wilgen is passionate about enabling organisations to be small at all levels and cultivating a culture that supports this, using continuous delivery, agile, Kanban, data-driven decision making, DevOps, lean, learning organisations and microservices. Together with agile thought-leader Sander Hoogendoorn, Kim is writing a new book titled The Continuous Culture."}],"startTime":"2017-10-30T11:45","endTime":"2017-10-30T12:15","slug":"continuously_delivering_continuo"},{"intendedAudience":"Anyone interested in coding \"the right way\" (clean coding) should definitely attend this session. Although Java will be used as the language of the code samples on the slides, immutability is a concept independent of Java. This means that Marcus's talk will be understandable to any kind of developer. He explains everything as clearly and simply as possible. There will be some simple code in the slides, but no live coding has been planned.","endTimeZulu":"2017-10-30T13:45:00Z","keywords":["Programming languages","Clean Code","topic:Concepts / Theory","type:"],"format":"presentation","language":"en","sessionId":"0c1835aa-ee0c-431a-8b99-76279f2d0763","abstract":"In this valuable talk, Marcus will describe exactly what immutable classes are. He'll tell you about their advantages and disadvantages, and show you how to create them. He'll finish by giving you concrete advice on when to use immutable classes in your daily work.","published":"true","video":"https://vimeo.com/240525367","title":"In a Nutshell: Immutable Classes","room":"Sal 3","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T13:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/5fada8ab2d8d053004959c1a3dc68a31?d=mm","name":"Marcus Biel","bio":"Marcus Biel (@MarcusBiel) is a Software Craftsman, a Clean Code Evangelist and Java influencer. Since 2001, Marcus has worked as a developer and architect on many different Java related projects, mostly in the finance and telecommunications industries. Right now he is working on https://cleancodeacademy.com/, an online platform dedicated to teaching aspiring Java Craftsmen."}],"startTime":"2017-10-30T14:15","endTime":"2017-10-30T14:45","slug":"in_a_nutshell_immutable_classes"},{"intendedAudience":"Du har kodet før, i et dynamisk språk som python eller javascript eller et mer lavnivå språk som C eller C++, eller noe i mellom. Du har lyst til å lære om et nytt programmeringsspråk. Live koding.","endTimeZulu":"2017-10-30T16:00:00Z","keywords":["programmeringsspråk","topic:Other Awesomeness","type:"],"format":"presentation","language":"no","sessionId":"16f3cb9e-9fb7-419b-9bdb-4cf8b70219a2","abstract":"Rust er et programmeringsspråk utviklet av Mozilla og et stort community, laget først og fremst for å skrive nettlesere og operativsystemer. Samtidig har det høynivå abstraksjoner vi er mer vant til i språk som python, ruby og javascript, men siden abstraksjonene ligger i kompilatoren kan ytelsen sammenlignes med håndoptimalisert kode skrevet i C eller C++.\n\nHvis det å lage tryggere og raskere kode, samtidig som du er like produktiv høres spennende ut, er dette foredraget for deg. Det vil bli en rask introduksjon til hva Rust er, litt om min erfaring med Rust og live koding for å gi en introduksjon som vil gi deg inspirasjon og hjelp til å komme i gang med Rust.","published":"true","video":"https://vimeo.com/240619951","title":"Rust - Fremtidens programmeringsspråk?","room":"Sal 5","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T15:30:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/0bcfc5c0589c5fbd24a009a00b114939?d=mm","name":"Sindre Ilebekk Johansen","bio":"Sindre er en nysgjerrig utvikler som jobber i Iterate. Han sitter for øyeblikket primært som konsulet på Amedia, der han jobber med å gi en god opplevelse til leserne av deres 65 lokalaviser. Han er også opptatt med en venture, http://woolit.no, skrevet i Rust og Elm."}],"startTime":"2017-10-30T16:30","endTime":"2017-10-30T17:00","slug":"rust__fremtidens_programmeringss"},{"intendedAudience":"Live coding. Grunnleggende kunnskap om javascript og typescript. Detter er ikke en intro til Typescrpt, men vil favne de fleste som enten koder eller har tenkt å kode i TypeScript.","endTimeZulu":"2017-10-30T13:45:00Z","keywords":["JavaScript","TypeScript","topic:Frontend","type:"],"format":"presentation","language":"no","sessionId":"b537bfbf-22b3-45e7-aad1-9003529d0f91","abstract":"Med TypeScript som alle andre språk, trenger man litt tid for å bli produktiv og finne flyten. Men man trenger ikke lære alle ting The Hard Way. Derfor har jeg kompilert noen schlägere som vil gjøre livet ditt i TS-land litt lettere.","published":"true","video":"https://vimeo.com/240531544","title":"Types & Triks med TypeScript","room":"Sal 5","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T13:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/c1b985125850cfe416b3e9873a3a5fab?d=mm","name":"Kjetil Klaussen","bio":"Elsker å kode, hater  debug'ing. Derav over snittet glad i automatisert testing slik at jeg slipper drittjobben selv."}],"startTime":"2017-10-30T14:15","endTime":"2017-10-30T14:45","slug":"types__triks_med_typescript"},{"intendedAudience":"Dette vil være en lavtersklet og moro sesjon for alle som er litt interessert eller nyskjerrig på JavaScript. Med ulike meninger og ulike forutsetninger i panelet vil det representere de fleste målgrupper som gjør at det vil være noe å hente for alle.","endTimeZulu":"2017-10-30T12:10:00Z","keywords":["Web Technologies","JavaScript","topic:Frontend","type:"],"format":"presentation","language":"no","sessionId":"53eed5db-5f4d-4c5d-b506-73053a52c751","abstract":"BartJS Podcast er en \"alt av JavaScript\"-podcast med opphav i Trondheim. Hver måned har vi med en gjest og har en uformell samtale om et tema som berører JavaScript.\n\nNå kjører vi vår aller første live show hvor du får muligheten til å være publikum. Vi har lest igjennom alle artikler av et fersk nyhetsbrev, velger våre favoritter og snakker om de. Her får du muligheten til å få med deg ulike perspektiver, høre diskusjoner og lære mye om JavaScript. Det kan også bli muligheter for å stille spørsmål.","published":"true","title":"BartJS Podcast Live","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T11:30:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/c1ad8925b70df4f6665315865511eafc?d=mm","name":"Mikael Brevik","bio":"Mikael Brevik er en programmeringsentusiast og engasjerer seg i utvikling av alle former. Driver regelmessig med open source utvikling, bloggskriving, videotutorial-laging, podcast innspilling, meetup-organisering og er fagleder for JS-plattform i BEKK."},{"pictureUrl":"https://www.gravatar.com/avatar/fd5606a96714d8a21d010621dea143e6?d=mm","name":"Marius Krakeli","bio":"BioMarius er en programmerer med forkjærlighet for behagelige brukeropplevelser. Han lar seg fascinere av JavaScript og er produsent og fast panelist på JavaScript-podcasten BartJS Podcast. Når han trenger et avbrekk fra programmeringsrelaterte aktiviteter, er han veldig underholdt av dataspill og videoproduksjon."},{"pictureUrl":"https://www.gravatar.com/avatar/60a5ce418250e26b42baef8ef7314f39?d=mm","name":"Christian Alfoni","bio":"Christian fant kjærligheten en sen høstdag for over 7 år siden og spenningen i forholdet er like potent i dag som den gang, om ikke mer. JavaScript og Christian feirer snart 8 års jubileum med bidrag i profesjonelle prosjekter, open source og privat."},{"pictureUrl":"https://www.gravatar.com/avatar/0149c56e84a4b03fef19c39ed27cc00d?d=mm","name":"Kristian Tryggestad","bio":"Kristian er en full-stack utvikler som trives aller best når han får jobbe med Javascript, HTML og CSS. Han er interessert i det aller meste som kan knyttes mot utvikling av web-applikasjoner, men er spesielt glad i nyvinninger som driver weben fremover og samtidig gjør livet lettere for oss utviklere."}],"startTime":"2017-10-30T12:30","endTime":"2017-10-30T13:10","slug":"bartjs_podcast_live"},{"intendedAudience":"Software architects, developers","endTimeZulu":"2017-10-30T09:45:00Z","keywords":["Architecture in Practice","Microservices","topic:Architecture","type:"],"format":"presentation","language":"en","sessionId":"8d8bb53b-af79-4a9a-b9ac-c926fe584dae","abstract":"We often think of performance testing as one of those things we just have to do at the end of a project, often using heavyweight tool sets in dedicated environments. In this talk, James offers an alternative. What decisions would we make differently if we had the ability to rapidly perform experiments using lightweight performance tests? The tools and techniques we now have available makes a new type of architectural decision making possible; from Software Defined Networking, IaaS and Continuous Delivery to Real Options and Architecture Decision Records.\nJames will cover pre-requisites that allow us to make small bets on performance and explore the strange world of evolutionary design that this technique makes possible.","published":"true","video":"https://vimeo.com/240509714","title":"Betting on Performance: A note on Hypothesis-driven Performance Testing","room":"Sal 3","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T09:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/c5e4a6eac24fc86507311c414dc54d8b?d=mm","name":"James Lewis","bio":"James Lewis studied Astrophysics in the 90's but got sick of programming in Fortran. As a member of the ThoughtWorks Technical Advisory Board, the group that creates the Technology Radar, he contributes to industry adoption of open source and other tools, techniques, platforms and languages. For the last few years he has been working as a coding architect on projects built using microservices; exploring new patterns and ways of working as he goes. James has spoken at many international conferences. His previous topics range from domain driven design, SOA and the future of the web to agile adoption patterns and lean thinking. He's also heavily involved in the fledgling microservice community. He rather likes the fact that he got to describe his take on things jointly with Martin Fowler in a paper that is influencing how people see the future of software architecture. Follow him @boicy"}],"startTime":"2017-10-30T10:15","endTime":"2017-10-30T10:45","slug":"betting_on_performance_a_note_on"},{"intendedAudience":"Testere og frontendutviklere burde deltatt på presentasjonen for å få mer innsikt i hvordan vi tester noen av de applikasjonene vi utvikler. Ved å bruke Cypress får vi veldig gode visuelle tilbakemeldinger på testene under utvikling, samtidig som de brukes som automatiserte tester på en byggeserver. Tilhørerne kan gjerne ha erfaring med testing generelt - og testing av frontend spesifikt. Vil benytte noe \"Code in slide\".","endTimeZulu":"2017-10-30T14:30:00Z","keywords":["JavaScript","Test","topic:Frontend","type:"],"format":"presentation","language":"no","sessionId":"efcbd0ea-20b5-46c0-a1f0-aeacb3a990b4","abstract":"Det brukes i dag fortsatt mye tid på manuelle regresjonstester av hva som faktisk vises i frontend; mange av disse er rene klikk-og-sjekk tester som både tar tid og energi. Dette er spesielt uheldig når man har begrenset tid i en stram leveranseprosess.\n\nDet finnes flere ende-til-ende testrammeverk for frontend som skal løse dette problemet, men disse feiler på flere punkter: gir lite innsikt i hva som skjer i testene, dårlige feilmeldinger, komplisert oppsett, tett knytning til applikasjonsrammeverk, lite dokumentasjon, ikke-levende support.\n\nI Kantega har vi det siste året prøvd ut Cypress som rammeverk for frontendtestene. Cypress er et helt nytt testverktøy som kjører i din browser. Cypress tilbyr et GUI som viser både applikasjon og tester i browseren, og tilbyr beskrivende og enkle feilmeldinger med utvidet støtte for debugging også i headless modus. Hvis din applikasjon kan kjøres i en browser, kan Cypress teste den.\n\nJeg vil presentere hvordan vi har brukt Cypress for å fjerne de manuelle regresjonstestene slik at vi kan bruke mer tid på test av ny funksjonalitet og mer utforskende testing. I tillegg vil jeg vise hvordan vi har strukturert testene for å redusere vedlikeholdet av testene.","published":"true","video":"https://vimeo.com/240535812","title":"Ta frontendtestene et skritt videre - test hva brukerne faktisk ser","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/f49e7563d3d938177965df4322f6f49e?d=mm","name":"Tor K Moseng","bio":"Tor K Moseng jobber som testleder og teknisk tester ved Kantega. Tor har jobbet med både funksjonell og ikke-funksjonell test for ulike prosjekter og kunder. Et fokus har vært å automatisere tester og prøve nye metoder og prosesser for å stadig øke kvaliteten på testene og leveransene. Tidligere har mest tid blitt brukt på automatisering av tester på backendsiden, inkludert ytelsestester, mens det nå har vært en prioritet å få automatisert tester også for frontendsiden."}],"startTime":"2017-10-30T15:00","endTime":"2017-10-30T15:30","slug":"ta_frontendtestene_et_skritt_vid"},{"intendedAudience":"Programmers and architects. There will be some code in the slides, and we will go through the code of the demo application.","endTimeZulu":"2017-10-30T15:15:00Z","keywords":["C#/.Net","JavaScript","topic:Backend","type:"],"format":"presentation","language":"en","sessionId":"834e5ade-4078-4f58-ade5-1b2c12d7d591","abstract":"In this session I will give an introduction to the actor model, and why it can make your life easier when writing reactive, scalable and distributed systems.\nWe will build a backend using ASP.NET Core and Akka.NET, demonstrating scaling out, location transparency and self healing in the event of errors (fail and fail hard). We will also deploy actors running under Mono on one or more Raspberry Pis as part of our actor system.\n\nFinally we will build a simple front end with React+Redux, write a custom middleware for SignalR, and connect it to our actor model running on the server. The front end will update itself in near real time as a direct result of messages from the actor system.","published":"true","video":"https://vimeo.com/240540658","title":"Getting real(time) with Akka.NET, React and Redux","room":"Sal 3","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/9f377f814fcb4694f6d8fe3cf635e267?d=mm","name":"Francis Paulin","bio":"I'm a full stack developer at Webstep Fokus in Oslo, and have been a software developer in the Oslo area for 8 years. I'm British, but have lived most of my life in Norway.\n\nI enjoy learning new things, and enjoy sharing what I`ve learned with others. I frequently give talks at work, and have spoken at several meetups in Oslo (NNUG, Framsia and ng-oslo), and have given talks at NDC in 2015 and 2017."}],"startTime":"2017-10-30T15:45","endTime":"2017-10-30T16:15","slug":"getting_realtime_with_akkanet_re"},{"intendedAudience":"Developers and software architects. Slides might contain some code.","endTimeZulu":"2017-10-30T13:45:00Z","keywords":["Architecture in Practice","Scalability","topic:Architecture","type:"],"format":"presentation","language":"en","sessionId":"f5953928-dbd8-47ea-b436-648c5ffb9de9","abstract":"gRPC is a high performance, open-source universal RPC framework and Kubernetes is an open-source system for automating deployment, scaling, and management of containerized applications. In this talk I'll give an introduction to what these technologies are, and how we at Disruptive Technologies use them building our IoT cloud solution.","published":"true","video":"https://vimeo.com/240510051","title":"Building efficient micro-services using Kubernetes, Go and gRPC","room":"Sal 2","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T13:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/ae284666a2da7093c26206dc6e4c0f7a?d=mm","name":"Ørjan Bruland","bio":"Been moving around the stack for the last 10 years building and architecting software products. Currently working as a tech lead for cloud related software development at Disruptive Technologies."}],"startTime":"2017-10-30T14:15","endTime":"2017-10-30T14:45","slug":"building_efficient_microservices"},{"intendedAudience":"An interest in AI (machine learning) is required but everything will be explained in, hopefully, just enough detail for both designers and developers find interesting.","endTimeZulu":"2017-10-30T15:15:00Z","keywords":["Machine learning","Chatbots","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"ef9dd613-ae6e-40e6-aa5d-dfa95ebf269b","abstract":"We envision a future where we are able to interact naturally with our computers, a future where-by our computers know and understand us, delivering personalised and seamless experiences, but our current methods and tools were established in an era where computers were fairly static and the interactions limit. \nIn this talk we explore what it means to design with data; using the example of a chatbot, we look at methodologies and tools that are likely to be adopted by designers in era of AI systems.","published":"true","video":"https://vimeo.com/240537294","title":"Data Driven Conversation","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/fe7439c5e09cb710f410c587b74172cd?d=mm","name":"Joshua Newnham","bio":"Lead Design Technologist at Method; working on designing and building digital solutions that make our lives a little easier and more enjoyable."}],"startTime":"2017-10-30T15:45","endTime":"2017-10-30T16:15","slug":"data_driven_conversation"},{"intendedAudience":"Alle som har en fot innen programvareutvikling. Utviklere, kravstillere, designere, arkitekter, testere, prosjektledere. No code.","endTimeZulu":"2017-10-30T09:45:00Z","keywords":["Security","Privacy","topic:Other Awesomeness","type:"],"format":"presentation","language":"no","sessionId":"19565f94-361a-484d-9ce7-b443e373b4b8","abstract":"I mai 2018 får vi nye personvernregler (GDPR). Innbyggerne får nye og bedre rettigheter, og virksomheter får nye plikter. En viktig nyhet er kravet om at alle nye løsninger skal ha innebygd personvern (Data Protection by Design) og personvern skal være standardinnstilling. Hva betyr det og hvordan kan det løses? Datatilsynet har tatt utgangspunkt i kjente metoder for sikker utvikling, og med gode innspill fra sikkerhetseksperter og utviklere i privat og offentlig sektor, har vi laget en veileder for hvordan personvern og sikkerhet kan bygges inn i programvare. Følger du denne kan du ha løsningen til morgendagens personvern.","published":"true","video":"https://vimeo.com/240490269","title":"Utviklere har nøkkelen til morgendagens personvern","room":"Sal 2","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T09:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/54dfaa7a2b9f68592b7fde0335269e6f?d=mm","name":"Martha Eike","bio":"Martha er utdannet dataingeniør med ni års erfaring fra QA og programvareutvikling i privat sektor. Hun begynte å jobbe i Datatilsynet for fem år siden og har opparbeidet seg erfaring med skytjenester, digitalisering av offentlig sektor, opplæringssektoren, innebygd personvern, og Big Data. Martha koordinerer det utadrettede arbeidet med informasjonssikkerhet hvor det kommende personvernregelverket har høyeste prioritet."}],"startTime":"2017-10-30T10:15","endTime":"2017-10-30T10:45","slug":"utviklere_har_nkkelen_til_morgen"},{"intendedAudience":"Interesting content for both ML and renewable energy fans fans, the talk is more about the approach to the problem than concrete technologies, but I might include slices of code to pinpoint ease of use of certain open source libraries.","endTimeZulu":"2017-10-30T13:45:00Z","keywords":["BigData","Machine learning","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"f3c17de7-a41f-44c1-94ed-3e7981bedffc","abstract":"The main goal of this talk is to show how rapidly can surprising results be reached when Artificial intelligence is applied to wind power forecasting problem, how do you approach such a problem, and operationalise  the machine learning model to bring real business difference.  We will take closer look not only on tools and practices, but also why current approaches were not that successful, and what made this approach work.","published":"true","video":"https://vimeo.com/240520837","title":"Machines are learning wind power forecasting","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T13:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/35c02feb757d8a49999434e5c2dab439?d=mm","name":"Boris Tistan","bio":"I'm data science expert working in Powel, Trondheim based software company that provides solutions to high majority of energy producers in Nordics. I hold master degree in Artificial Intelligence, and I've worked on multiple applications of Machine learning in energy sector, including Electricity consumption forecast, Wind and Solar power forecasting and other big data applications. I'm very passionate about innovative technologies and environment, and this  case was a perfect marriage of those two.\n\nI always talk too much and rarely stick to the script, but my goal is to engage the audience and try for them to share my passion."}],"startTime":"2017-10-30T14:15","endTime":"2017-10-30T14:45","slug":"machines_are_learning_wind_power"},{"intendedAudience":"Denne talken vil inneholde kode, og det er en fordel å ha kjennskap til JavaScript. Jeg håper jeg vil møte mange med interesse for hva som skjer under panseret med JavaScript-koden man skriver, og kanskje, kanskje kommer det noen som ønsker å skrive sine egne linte-regler eller Babel-plugins.","endTimeZulu":"2017-10-30T15:15:00Z","keywords":["JavaScript","AST","topic:Frontend","type:"],"format":"presentation","language":"no","sessionId":"fb20c91e-6207-4081-af22-0558647b547c","abstract":"Ikke mange vet hvordan en kompilator virker, og enda færre har skrevet en selv. Men ville det ikke vært interessant å vite litt mer om hva som skjer under panseret når ES6-koden din blir transpilert til ES5-kode? Eller hvordan du selv kan koble deg på denne transpileringen og ta kontroll over din egen kode?\n\nJeg vil i denne talken gi en kort introduksjon til de grunnleggende stegene koden din går igjennom når den kompileres. Jeg vil gi en introduksjon til datatrukturen Abstract Syntax Trees, og vise hvordan du enkelt kan benytte deg av denne datastrukturen til å skrive egne linte-regler med ESLint, egne kodetransformasjoner med Babel, og egne codemods med jscodeshift.","published":"true","video":"https://vimeo.com/240619927","title":"Abstract Syntax Trees - ta kontroll over koden din","room":"Sal 5","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/60b2fccfaf832f5110f582b955238ef3?d=mm","name":"Jørgen Aaberg","bio":"Jørgen jobber som konsulent for Iterate. Spesielt interessert i alt av front-end og JavaScript, men har også i det siste begynt å snuse på Elm. Ellers glad i løping og en god kopp svart kaffe."}],"startTime":"2017-10-30T15:45","endTime":"2017-10-30T16:15","slug":"abstract_syntax_trees__ta_kontro"},{"intendedAudience":"No code. Utviklere, ledere, prosjektledere, designere og ellers alle som ønsker å bli bedre på å kommunisere visuelt, men som mangler selvtillit med pennen.","endTimeZulu":"2017-10-30T13:45:00Z","keywords":["Communication","topic:Other Awesomeness","type:"],"format":"presentation","language":"no","sessionId":"7a52dc8f-037c-46b2-b5ea-fcb3424a3e4e","abstract":"Tegner du fortsatt som en søvnig treåring? Vegrer du deg for å plukke opp whiteboard markeren på møter?  Vil du tegne for å kommunisere men tenker at du ikke har ferdighetene til å gjøre det? La oss overbevise deg om det motsatte med enkle tips og triks.\n\nVi knuser myten om at du må tegne som da vinci for å kunne kommunisere godt. Du får vite hvorfor tegning fungerer og hvordan du kan bruke tegning til å forstå, huske, engasjere og se nye løsninger.","published":"true","video":"https://vimeo.com/240527244","title":"The Power of Drawing — Use the Force","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T13:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/7e31b5f744d298aeb9d99266c67e16ef?d=mm","name":"Hanne Linander","bio":"Hanne er en interaksjonsdesigner som jobber for at brukere av digitale produkter skal få den best mulige brukeropplevelsen. Det hun liker best ved jobber er å snakke med folk og å skisse ut løsninger sammen med andre. Hun har alltid vært glad i å tegne, og får ofte bruk for dette i jobben.\n\nHun jobber nå for Bekk Consulting AS i Trondheim, og har gjort dette de to siste årene, sammen med utviklere og andre designere, både for private og offentlige kunder."},{"pictureUrl":"https://www.gravatar.com/avatar/188ce74d2870f5196e80fab29b215a05?d=mm","name":"Kine Vaagan","bio":"Kine er grafisk designer, og jobber for å dyrke tydelige budskap og autentiske visuelle identiteter. Hun tar med seg en glød for visuell kommunikasjon og en lun humor som gjør den rotete prosessen med å lage effektfulle løsninger til en lek.\n\nDe siste to årene har hun jobbet i BEKK i Trondheim."}],"startTime":"2017-10-30T14:15","endTime":"2017-10-30T14:45","slug":"the_power_of_drawing__use_the_fo"},{"intendedAudience":"This talk is for those who would like to learn something about the ideas and principles behind the Erlang language and the systems built with it, the Erlang ecosystem. It will describe some other languages running on the   ecosystem. No previous knowledge of Erlang is required. There is some code in slides.","endTimeZulu":"2017-10-30T14:30:00Z","keywords":["Designs","Scalability","topic:Architecture","type:"],"format":"presentation","language":"en","sessionId":"1642eb45-24ca-49ed-8e62-d1184aae9973","abstract":"Erlang is in many ways quite old though many of the problems for which it used are quite modern. The Erlang language and system was designed around a set of requirements for telecom systems. They were distributed, massively concurrent systems which had to scale with demand, be capable of handling massive peak loads and never fail. The Erlang concurrency and error-handling model was developed around these requirements.\n\nThis talk will describe the development of the language and the design of systems based on the Erlang. It will also look at the further development with the introduction of new languages in the Erlang environment - the Erlang ecosystem.","published":"true","video":"https://vimeo.com/240534113","title":"The Erlang Ecosystem","room":"Sal 3","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/b2bb6871244c6652b66bd5e875e6a519?d=mm","name":"Robert Virding","bio":"Robert Virding is one of the co-inventors of Erlang and was an early member of the Ericsson Computer Science Lab. He took part in the original system design and contributed much of the original libraries, as well as to the current compiler.\n\nHe has always been interested in language design and implementation and at the lab he did a lot of work on the implementation of functional and logic languages. More recently he has done a number of implementations of different languages in Erlang, and on the Erlang system, which have been spread and used externally.\n\nHe is now Principal Language Expert at Erlang Solutions Ltd. and is regularly invited to teach and present throughout the world."}],"startTime":"2017-10-30T15:00","endTime":"2017-10-30T15:30","slug":"the_erlang_ecosystem"},{"intendedAudience":"This talk is for people interested in data storage and alternative solutions to the problems large amounts of data provides. There will be some code in slides, but there should also be enough to keep non-technical people on the front of their seats.","endTimeZulu":"2017-10-30T16:00:00Z","keywords":["Java/JVM","BigData","topic:Backend","type:"],"format":"presentation","language":"en","sessionId":"f501146d-2cbd-4dab-86ab-41cd1283973f","abstract":"When working with large amounts of data, how to organize said data will always be an open topic for discussion. If this data is all interconnected, you might also run into performance problems. This is where graph databases step into the light and shines like a bright star.\n\nAt ParrotPlay, we made The Mighty Media Graph as a solution to the problem we had with large data sizes combined with social interaction. This problem could not be solved using traditional databases, and we had to leverage the power of graph databases. This talk shows the problems we found while making the leap into the land of the graphs, and how we solved these.","published":"true","title":"The Mighty Media Graph - Living on the Cutting Edge","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T15:30:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/b624e8c67eb07d82be2a3e8b6bbb243f?d=mm","name":"Stig Runar Vangen","bio":"With over 10 years working as a professional developer, Stig has a wide background in software development. Proficient in both backend and frontend, always interested in new technologies and new ways to solve problems. He is currently working as a developer for ParrotPlay, where he tries to provide everyone with their  entertainment needs."}],"startTime":"2017-10-30T16:30","endTime":"2017-10-30T17:00","slug":"the_mighty_media_graph__living_o"},{"intendedAudience":"Aktuelt for alle som er interesserte i kognitive tjenester og kunstig intelligens.\nForedraget er en lett miks av slides og konkrete kodeeksempler/demo.","endTimeZulu":"2017-10-30T11:15:00Z","keywords":["Machine learning","Cognitive Services","topic:Other Awesomeness","type:"],"format":"presentation","language":"no","sessionId":"b6cc96c2-c3d5-4b4b-953e-1ed68e0668d9","abstract":"Gjennom bruk av avansert maskinlæring og effektive algoritmer for kunstig intelligens gjør de kognitive tjenestene i Microsoft Azure det mulig å hente ut smart innsikt om ansikter, bilder og følelser.  Vi ser her nærmere på hva dette innebærer i praksis og hvordan man kan utnytte disse mulighetene med kodeeksempler fra en applikasjon som benytter seg av ansiktsgjenkjenning.","published":"true","video":"https://vimeo.com/240520126","title":"Avansert ansiktsgjenkjenning med Azure Cognitive Services","room":"Sal 5","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/786e55500871ce71426b6e904e305b4d?d=mm","name":"Anders Erling Aabakken","bio":"Anders er seniorkonsulent og medeier i Fundator AS, og har over 20 års erfaring med systemutvikling, integrasjon og teknisk arkitektur. Han har en brennende interesse for den teknologiske utviklingen og fokuserer nå på mulighetene som ligger i bruk av skyteknologi.  Innehar blant annet titlene MCSD: Azure Solutions Architect og MCSE: Cloud and Infrastructure og er  styremedlem i NNUG Trondheim"}],"startTime":"2017-10-30T11:45","endTime":"2017-10-30T12:15","slug":"avansert_ansiktsgjenkjenning_med"},{"intendedAudience":"No code (but tons of cool, real-world examples)","endTimeZulu":"2017-10-30T15:15:00Z","keywords":["Mobile","VR","topic:Design","type:"],"format":"presentation","language":"no","sessionId":"7634ecea-0a64-4352-9039-80ff8cab925b","abstract":"Blueye Robotics is a Norwegian startup from Trondheim with a vision to create the world's best underwater drone.\n\nAlexander Vanvik and Martin Rechsteiner from EGGS Design, will talk about how they worked with Blueye across a wide range of disciplines; interface design, product design and software development. \n\nFOR THE CREATORS - There is often a divide between those who design and those who implement. This talk is for developers and designers who want to work together to create great products for real users.\n\nFOR THE EXPLORERS - There is a world under the sea that has been ripe for exploration for a long time but unaccessible to anyone without scuba gear or expensive professional ROVs. This talk will show how we have worked with Blueye to create a great experience of exploration and immersion for anyone with a smart phone.\n\nThis talk will be equal parts cool technical anecdotes, best practices for co-operation and lots of crazy prototyping 💥","published":"true","video":"https://vimeo.com/240576733","title":"Designing Underwater Experiences","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:45:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/fa5c83b4d11a67cba397f2b269172af0?d=mm","name":"Alexander Vanvik","bio":"Alexander er en designer med en hemmelig forelskelse i kode. Han har kompetanse innenfor design av brukergrensesnitt på små og store flater, og utvikling av digitale prototyper.\n\nDigital designer i EGGS Design"},{"pictureUrl":"https://www.gravatar.com/avatar/853498f24203f08d73634c94400a825a?d=mm","name":"Martin Rechsteiner","bio":"Martin er en allsidig utvikler med bred erfaring innenfor en rekke teknologier. Han tar han ofte del i hele utviklingsprosessen fra konseptutvikling, til design og prototyping av nye idéer, og implementering av ferdige produkter.\n\nUtvikler i EGGS Design"}],"startTime":"2017-10-30T15:45","endTime":"2017-10-30T16:15","slug":"designing_underwater_experiences"},{"intendedAudience":"Anyone with an interest in developing mobile apps.","endTimeZulu":"2017-10-30T14:30:00Z","keywords":["Apps","Mobile","topic:Frontend","type:"],"format":"presentation","language":"en","sessionId":"3f8d8511-fe2f-4f35-a34f-1e0cb82862d9","abstract":"App development is an iterative process all the way from idea through prototyping to the final product. However, while you have good tools for each single stage the hand-off between them tends to be cumbersome and creates multiple \"points of no return\" where it's really hard to go back and make changes. \nIn other words: we all know waterfall processes are inefficient (actually, they're plain *bad*) but we're still often forced to work that way!\n\nFuse is an app development platform which addresses this and provides super-efficient workflows for both developers *and* designers.\n\nThe not-so-secret-sauce involves:\n\n* Enabling and encouraging experimentation & iteration.\n\n* Providing intuitive abstractions for everything from native integrations to UI.\n\n* The best markup language you’ve ever seen.\n\nIn this talk we’ll take a look at some of the neat features of Fuse - and build a small app while we’re at it!","published":"true","video":"https://vimeo.com/240543787","title":"Less Code, More App","room":"Sal 5","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/ff13e61fcc800a1d0e4a116fdf578a8d?d=mm","name":"Remi Pedersen","bio":"Code-&-Product-person, Fusetools\n\nRemi works with Fuse - building tools for mobile app developers and designers. Back in the dark ages he was at Falanx and ARM, developing the \"Mali\" brand of graphics accelerators which have shipped in billions of mobile devices by now. \nHe's been programming for over 25 years and has even more experience talking and gesticulating (something he'll happily do about subjects such as the demoscene, startups, and HW & SW tech). Late at night he still codes demos for his trusty old Amiga 500."}],"startTime":"2017-10-30T15:00","endTime":"2017-10-30T15:30","slug":"less_code_more_app"},{"intendedAudience":"Everyone","endTimeZulu":"2017-10-30T16:45:00Z","keywords":["inspiration","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"7fda3382-995d-4bcd-9951-caa3fe20915d","abstract":"-","published":"true","video":"https://vimeo.com/240619869","title":"Avoiding the Apocalypse :Finding the balance between technology and humanity","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T16:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/b2e85218336e95e2c5ca63cf0490c17b?d=mm","name":"Anna Kirah","bio":"Anna is an internationally acclaimed design anthropologist and psychologist who has worked in corporations such as Boeing and Microsoft, and consulted with clients in a wide variety of sectors including software development, advertising, transportation, retail, banking, and public services.\n\nMuch of Anna’s research relates to the impact of the digital lifestyle on companies and organizations and the subsequent changes in how we meet the demands of the people we serve (our customer’s and potential customer’s both inside and outside of our organizations).  \n\nAnna´s trademark is the people-centric approach to innovation and the user experience, which requires the involvement of “users” in the design of services, products and organizational change.  She was on the board of Denmark´s User Driven Innovation Fund promoting the people-centric approach in both Denmark´s private and public sectors.  In addition to Making Waves, she sits on the board of Design Without Borders which applies strategic service design to solving challenges in developing countries.  When she is not at work, she is often found in the forest hunting moose and birds or picking mushrooms and cloudberries."}],"startTime":"2017-10-30T17:15","endTime":"2017-10-30T17:45","slug":"avoiding_the_apocalypse_finding_"},{"intendedAudience":"No code","endTimeZulu":"2017-10-30T09:00:00Z","keywords":["Paradigms","Algorithms to Live By","topic:Concepts / Theory","type:"],"format":"presentation","language":"en","sessionId":"ffa66dbb-eab5-4782-abe7-71b9fe7fbd7a","abstract":"There is a particular set of problems that all people face, problems that are a direct result of the fact that our lives are carried out in finite space and time. What should we do, or leave undone, in a day or a lifetime? What degree of mess should we embrace—and how much order is excessive? What balance between trying new things and enjoying our favorite ones makes for the most fulfilling life?\n\nThese might seem like problems unique to humans; they're not. For more than half a century, computer scientists have been grappling with, and in many cases solving, the equivalents of these everyday dilemmas. From finding a spouse to finding a parking spot, from organizing our inbox to predicting the future, the solutions they’ve found have much to teach us. Learning to recognize the underlying algorithmic structure of the world around us gives us the tools to transform the wisdom of computer science into strategies for human living.","published":"true","video":"https://vimeo.com/240482287","title":"Algorithms to Live By: The Computer Science of Human Decisions","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T08:10:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/fe858f02a39dcdd69e1612d2ef890147?d=mm","name":"Brian Christian","bio":"Brian Christian is the author of The Most Human Human, which was named a Wall Street Journal bestseller and a New Yorker favorite book of the year, and has been translated into ten languages. He is the coauthor, with Tom Griffiths, of Algorithms to Live By, a #1 Audible bestseller, Amazon best science book of the year and MIT Technology Review best book of the year."}],"startTime":"2017-10-30T09:10","endTime":"2017-10-30T10:00","slug":"algorithms_to_live_by_the_comput"},{"intendedAudience":"This talk is for those who are interested in language and system design and some of the more abstract issues that arise while doing while designing. It is not specific to any one class of languages.\nThere is no code in the slides.","endTimeZulu":"2017-10-30T16:00:00Z","keywords":["Philosophy","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"08eacce7-0c77-4856-9652-4b1086b1aa58","abstract":"These are some thoughts, maybe even a philosophy, I have about program language design based on my experiences with various programming languages. They include languages I have used, languages I have implemented and also languages I have been a part of in designing and implementing. These languages have come from many different language groups and have had different characteristics. Much of this is also valid to system design as well.","published":"true","video":"https://vimeo.com/240619844","title":"On Language Design","room":"Sal 2","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T15:30:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/b2bb6871244c6652b66bd5e875e6a519?d=mm","name":"Robert Virding","bio":"Robert Virding is one of the co-inventors of Erlang and was an early member of the Ericsson Computer Science Lab. He took part in the original system design and contributed much of the original libraries, as well as to the current compiler.\n\nHe has always been interested in language design and implementation and at the lab he did a lot of work on the implementation of functional and logic languages. More recently he has done a number of implementations of different languages in Erlang, and on the Erlang system, which have been spread and used externally.\n\nHe is now Principal Language Expert at Erlang Solutions Ltd. and is regularly invited to teach and present throughout the world."}],"startTime":"2017-10-30T16:30","endTime":"2017-10-30T17:00","slug":"on_language_design"},{"intendedAudience":"Everyone with an interest for machine learning and AI.","endTimeZulu":"2017-10-30T14:30:00Z","keywords":["Machine learning","topic:Other Awesomeness","type:"],"format":"presentation","language":"en","sessionId":"58236a85-981c-42b8-b847-50a9df931ab7","abstract":"The talk will give an introduction to how we work with artificial intelligence at Telenor Research.","published":"true","title":"Artificial intelligence at Telenor Research","room":"Sal 1","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T14:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/266df8eda25748c32905a1a00fc2c20b?d=mm","name":"Axel Tidemann","bio":"Axel Tidemann has a PhD in artificial intelligence from NTNU. He is a research scientist at Telenor Research, where he works with deep learning to understand images, text and sequences."}],"startTime":"2017-10-30T15:00","endTime":"2017-10-30T15:30","slug":"artificial_intelligence_at_telen"},{"intendedAudience":"Designere, utviklere, bedriftsledere, produkteiere, styremedlemmer. Lær mer om corporate startups slik at du velger godt og er bedre forberedt på å gjennomføre innovasjonsprosesser. No code.","endTimeZulu":"2017-10-30T10:30:00Z","keywords":["UX","lean","topic:Design","type:"],"format":"presentation","language":"no","sessionId":"99374008-8d58-4f0f-ba69-63001b667e75","abstract":"Det ryktes at det nå til dags finnes nye metoder som gjør IT-bransjens ordspråksfavoritt til skamme. Før het det at du kan få en tjeneste som er rask å lage, billig å utvikle og god i bruk – så lenge du velger kun to av disse faktorene.  \n \nKjært barn har mange navn: Design thinking, design sprint, lean, agile, corporate startups. Alle disse metodene vil oppnå det vi alle drømmer om: Å jobbe smart slik at man ikke bruker unødvendige ressurser, og kommer hurtig frem til et godt resultat med lav risiko ved lansering.\n \nDette foredraget er en fortelling om en corporate startup: Et tverrfaglig, samlokalisert team, satt sammen for å gi nytt liv til den konservative eiendomsmeglerbransjen – på 3 måneder. Du vil få høre praktiske eksempler på både vonde og vakre eventyr, med noen velvalgte råd til slutt.","published":"true","video":"https://vimeo.com/240477089","title":"Innovasjonsmaskinen Corporate Startup","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/3f9a564b01151a5dcfac2c969bb7aae6?d=mm","name":"Berit Alvestrand","bio":"Berit Alvestrand er utdannet industridesigner fra NTNU og har jobbet med digital tjenesteutvikling siden. Hun har tidligere vært UX Manager i Zedge, og jobber nå som Senior Designer i EGGS Design. Berit har opparbeidet solid erfaring med å jobbe i helhetlige prosesser, fra tidlig konseptutvikling på strategisk nivå, til implementering i tett samarbeid med utviklere."}],"startTime":"2017-10-30T11:00","endTime":"2017-10-30T11:30","slug":"innovasjonsmaskinen_corporate_st"},{"intendedAudience":"Foredraget er for deg som jobber med spillutvikling, design og brukervennlighet. I tillegg vil du som er forelder ha stor glede av å høre på oss. Dette er et helt kodefritt foredrag, og er en blanding mellom inspirasjon og læring","endTimeZulu":"2017-10-30T09:45:00Z","keywords":["Graphic","Apps","topic:Design","type:"],"format":"presentation","language":"no","sessionId":"68c89d70-4b2a-4758-b136-399467be6bd3","abstract":"Er det mulig å få barn til å ta ut av oppvaskmaskinen, støvsuge og rydde rommet med glede? Dette er historien om hvordan vi laget Mænage, et seriøst spill som hjelper familier med å planlegge, organisere, og utføre husarbeid på en morsom og engasjerende måte. Gjennom historien viser vi deg hvordan vi brukte spillmekanikk, gamification og teorier om motivasjon og adferdsendring for å utforme spillet. Vi forteller deg også hva seriøse spill er og har selvfølgelig gode råd om hva du selv må tenke på når du skal lage slike spill.","published":"true","video":"https://vimeo.com/240464574","title":"Historien om hvordan vi gjorde husarbeid til en lek med Mænage, et seriøst spill for adferdsendring","room":"Sal 4","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T09:15:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/7f302e5eb94d4ed6139b3e8e9078f643?d=mm","name":"Alf Inge Wang","bio":"Alf Inge Wang er professor i dataspill ved NTNU. Han står bak suksessen Kahoot som har over 200 millioner brukere og har passert 1 milliard brukersesjoner. Nå forsøker han å legge grunnlaget for en like stor suksess med Mænage."},{"pictureUrl":"https://www.gravatar.com/avatar/30a2e206a8401c93a96eaa55f0f12ead?d=mm","name":"Ole Andreas Alsos","bio":"Ole Andreas Alsos er daglig leder og grunnlegger av Serious Games AS og en av oppfinnerne av Mænage. Han er også interaksjonsdesigner, IT-rådgiver i BEKK og førsteamanuensis ved Institutt for datateknologi og informatikk ved NTNU. Han har tre barn som bidrar lite hjemme."}],"startTime":"2017-10-30T10:15","endTime":"2017-10-30T10:45","slug":"historien_om_hvordan_vi_gjorde_h"},{"intendedAudience":"Frontendutviklere som vil forbedre sine applikasjoner, og andre utviklere som er nysgjerrige på mulighetene i webteknologi. Grunnleggende om PWA men forutsetter noe kunnskap om frontendutvikling. Code in slides og live demo.","endTimeZulu":"2017-10-30T10:30:00Z","keywords":["Web APIs (WebVR, Audio, BLE)","topic:Frontend","type:"],"format":"presentation","language":"no","sessionId":"41a83330-9da4-45ff-bbeb-140b53597bd0","abstract":"Progressive web applications (PWA) er webapplikasjoner som nærmer seg en native applikasjoner i funksjonalitet, samtidig som de kan virke på alle browsere. Du kan få støtte for bruk offline, du kan sende varsel fra din server til applikasjoner og få opp varselet selv om nettleser ikke kjører, og andre ting som før var forbeholdt native applikasjoner. I tillegg vi applikasjonen din laste raskere enn før.\n\nAlt dette er vel og bra, men hvordan funker det egentlig? PWA ikke én teknologi men et sett med relaterte API'er, og det er lett å gå seg vill. PWA er også mer komplekst enn annen lettleser-API ved at f.eks. push-meldinger krever server-støtte.\n\nJeg vil gi deg gode eksempler satt inn i en helhetlig ramme, slik at det blir lett å gå hjem og gjøre dette på egen hånd. Kom for å få en konkret gjennomgang av de grunnleggende API'ene og eksempler på bruk i praksis.","published":"true","video":"https://vimeo.com/240504272","title":"Progressive web applications i praksis","room":"Sal 5","conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","startTimeZulu":"2017-10-30T10:00:00Z","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/bcb4ce98e285374dc8a224d15d71be8d?d=mm","name":"Håvard Wigtil","bio":"Håvard jobber som konsulet i Kantega AS, i hele stacken når han får mulighet, og overlevde nettleserkrigene på 1990-tallet."}],"startTime":"2017-10-30T11:00","endTime":"2017-10-30T11:30","slug":"progressive_web_applications_i_p"},{"intendedAudience":"Anyone interested in microservices","keywords":["Microservices","topic:Other Awesomeness","type:"],"conferenceId":"1f876502-d3c3-44f6-8ea3-a4d0e16331dd","speakers":[{"pictureUrl":"https://www.gravatar.com/avatar/c5e4a6eac24fc86507311c414dc54d8b?d=mm","name":"James Lewis","bio":"James Lewis studied Astrophysics in the 90's but got sick of programming in Fortran. As a member of the ThoughtWorks Technical Advisory Board, the group that creates the Technology Radar, he contributes to industry adoption of open source and other tools, techniques, platforms and languages. For the last few years he has been working as a coding architect on projects built using microservices; exploring new patterns and ways of working as he goes. James has spoken at many international conferences. His previous topics range from domain driven design, SOA and the future of the web to agile adoption patterns and lean thinking. He's also heavily involved in the fledgling microservice community. He rather likes the fact that he got to describe his take on things jointly with Martin Fowler in a paper that is influencing how people see the future of software architecture. Follow him @boicy"}],"format":"workshop","language":"en","sessionId":"436caa0e-2662-4bab-809b-133896d3b176","abstract":"Write programs that do one thing and do it well. Write programs to work together\" was accepted 40 years ago yet we have spent the last decade building monolithic applications, communicating via bloated middleware and with our fingers crossed that Moores Law keeps helping us out.\n\nMicroservices. In this tutorial we will discover a consistent and reinforcing set of tools and practices rooted in the the Unix Philosophy of small and simple. Tiny applications, communicating via the webs uniform interface with single responsibilities and installed as well behaved operating system services. Based on advances in Domain Driven Design, Continuous Delivery, Evolutionary architecture and event driven architecture, microservices bring together the better practices that have emerged over the last decade of innovation is software development\n\nIn this course we will explore the following topics:\n\n•\tPrinciple-driven evolutionary architecture\n•\tCapability modelling, domain driven design and the town planning metaphor\n•\tREST, web integration and event-driven systems of systems\n•\tMicroservices, versioning, consumer driven contracts and postels law\n•\tTesting, Building and continuous delivery\n•\tOperational concerns including monitoring, alerting and architectural safety.","published":"true","title":"Microservices – Evolutionary Approaches for Building Systems of Systems (2 Days)","slug":"microservices__evolutionary_appr"}]}